brew "bat"
brew "fzf"
brew "git"
brew "go"
brew "golang-migrate"
brew "jq"
brew "helm"
brew "kubernetes-cli"
brew "lsd"
brew "mas"
brew "starship"
brew "stow"
brew "wget"
brew "wimlib"
brew "zoxide"
brew "zsh-autocomplete"
brew "tlrc"
brew "btop"
brew "dust"
brew "podman"
brew "podman-compose"
cask "1password"
cask "intune-company-portal"
cask "chatgpt"
cask "docker"
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"
cask "firefox"
cask "google-chrome"
cask "iina"
cask "intellij-idea"
cask "miro"
cask "obsidian"
cask "raycast"
cask "visual-studio-code"
cask "slack"
cask "azure-data-studio"
cask "podman-desktop"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "golang.go"
vscode "humao.rest-client"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.powershell"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "vscjava.vscode-gradle"
vscode "yzhang.markdown-all-in-one"